Autodesk.Revit.DB.EditModeType
Since:
2026
Identifies the possible edit modes that could be active in Revit.
Since:
2026

Autodesk.Revit.DB.EditModeType.FreeFormRebarEditMode
Editing of the Free Form rebar with a given shape distributed along a path.

Autodesk.Revit.DB.EditModeType.AnalyticalAutomation
Editing of analytical automation.

Autodesk.Revit.DB.EditModeType.ViewPosition
Editing of a view/viewport positioning on a sheet.

Autodesk.Revit.DB.EditModeType.SpliceRebars
Edit mode used when splicing rebars.

Autodesk.Revit.DB.EditModeType.IndividualBarEdit
Edit mode used during editing the individual bars of reinforcement elements (e.g. move, rotate, remove, include).

Autodesk.Revit.DB.EditModeType.RebarConstraints
Edit mode used during editing the rebar constraints.

Autodesk.Revit.DB.EditModeType.StructuralCustomConnection
Editing of custom structural connections.

Autodesk.Revit.DB.EditModeType.MultistoryStairsLevelLandings
Edit mode for adding or removing level-landings that connect different sections of multistory stairs.

Autodesk.Revit.DB.EditModeType.MultistoryStairsConnectedLevels
Editing of multistory stairs connected levels.

Autodesk.Revit.DB.EditModeType.FabricationPartRoute
Editing of a fabrication part route.

Autodesk.Revit.DB.EditModeType.Displacement
Editing of a displacement element.

Autodesk.Revit.DB.EditModeType.RailPath
Editing of railing paths.

Autodesk.Revit.DB.EditModeType.Stairs
Editing of stairs.

Autodesk.Revit.DB.EditModeType.MergedPart
Edit mode used when editing a merged part.

Autodesk.Revit.DB.EditModeType.Division
Edit mode used when dividing part elements.

Autodesk.Revit.DB.EditModeType.Assembly
Editing of an assembly.

Autodesk.Revit.DB.EditModeType.SurfaceConnector
Editing of a surface connector for a conduit.

Autodesk.Revit.DB.EditModeType.PanelScheduleTemplate
Editing of an electrical panel schedule template.

Autodesk.Revit.DB.EditModeType.JustifySlopeRouteEditor
Editing of a sloped sketch in a pipe system.

Autodesk.Revit.DB.EditModeType.InsulationLining
Editing of an insulation or lining objects.

Autodesk.Revit.DB.EditModeType.LightGroup
Editing of a light group.

Autodesk.Revit.DB.EditModeType.Zone
Editing of a zone's contents.

Autodesk.Revit.DB.EditModeType.LayoutPath
Editing of a layout path for duct or pipe systems.

Autodesk.Revit.DB.EditModeType.SelectionFilter
Edit mode used when creating or modifying a selection filter.

Autodesk.Revit.DB.EditModeType.SystemInspector
Edit mode used when the System Inspector for duct or pipe systems is active.

Autodesk.Revit.DB.EditModeType.Paste
Edit Pasted Elements mode.

Autodesk.Revit.DB.EditModeType.CopyMonitor
Copy monitor editing mode.

Autodesk.Revit.DB.EditModeType.CircuitGroup
Editing of an electrical circuit.

Autodesk.Revit.DB.EditModeType.Path3d
Editing of a 3D path, e.g. when picking the path of a sweep.

Autodesk.Revit.DB.EditModeType.Group
Group editing mode.

Autodesk.Revit.DB.EditModeType.MultiSketchElem
Top level edit mode for certain multi-sketch elements. E.g. for sweeps, this is the mode
entered after clicking the button to edit or create a sweep, but before editing either the
path or profile sketches.

Autodesk.Revit.DB.EditModeType.WallJoin
Editing of wall joins.

Autodesk.Revit.DB.EditModeType.Sketch
Editing the sketch of a sketch-based element, such as an extrusion, floor, roof, etc.

Autodesk.Revit.DB.EditModeType.InPlaceFamily
Edit mode used when editing an In-Place Family.

Autodesk.Revit.DB.EditModeType.None
No Edit Mode is currently active.